STMicroelectronics/fp-aud-smartmic1/Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xxxxx.h
  I2C3_ER_IRQn                = 73,     /*!< I2C3 error interrupt                                              */
#endif /* STM32F401xC || STM32F401xE ||STM32F405xx || STM32F407xx || STM32F411xE|| STM32F412Cx || STM32F412Rx || STM32F412Vx || STM32F412Zx || STM32F413xx || STM32F415xx || STM32F417xx || STM32F423xx || STM32F427xx || STM32F429xx || STM32F437xx || STM32F439xx || STM32F446xx || STM32F469xx || STM32F479xx */
#if defined(STM32F413xx) || defined(STM32F423xx)
  CAN3_TX_IRQn                = 74,     /*!< CAN3 TX Interrupt                                                 */
  CAN3_RX0_IRQn               = 75,     /*!< CAN3 RX0 Interrupt                                                */
  CAN3_RX1_IRQn               = 76,     /*!< CAN3 RX1 Interrupt                                                */
  CAN3_SCE_IRQn               = 77,     /*!< CAN3 SCE Interrupt                                                */
 #if defined(STM32F423xx)
  AES_IRQn                    = 79,     /*!< AES global Interrupt                                              */
 #endif /* STM32F423xx */
  RNG_IRQn                    = 80,     /*!< RNG global Interrupt                                              */
#endif /* STM32F413xx || STM32F423xx */
#if defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F415xx) || defined(STM32F417xx) || defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || defined(STM32F469xx) || defined(STM32F479xx)  
  OTG_HS_EP1_OUT_IRQn         = 74,     /*!< USB OTG HS End Point 1 Out global interrupt                       */
  OTG_HS_EP1_IN_IRQn          = 75,     /*!< USB OTG HS End Point 1 In global interrupt                        */
  OTG_HS_WKUP_IRQn            = 76,     /*!< USB OTG HS Wakeup through EXTI interrupt                          */
  OTG_HS_IRQn                 = 77,     /*!< USB OTG HS global interrupt                                       */
#endif /* STM32F405xx || STM32F407xx || STM32F415xx || STM32F417xx || STM32F427xx || STM32F429xx || STM32F437xx || STM32F439xx || STM32F446xx || STM32F469xx || STM32F479xx */
#if defined(STM32F407xx) ||defined(STM32F417xx) || defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || defined(STM32F469xx) || defined(STM32F479xx)  
  DCMI_IRQn                   = 78,     /*!< DCMI global interrupt                                             */
#endif /* STM32F407xx || STM32F417xx || STM32F427xx || STM32F429xx || STM32F437xx || STM32F439xx || STM32F446xx || STM32F469xx || STM32F479xx */
#if   defined(STM32F415xx) || defined(STM32F417xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F479xx)
  CRYP_IRQn                   = 79,     /*!< CRYP crypto global interrupt                                      */
#endif /* STM32F415xx || STM32F417xx || STM32F437xx || STM32F439xx || STM32F479xx */
#if defined(STM32F415xx) || defined(STM32F417xx) || defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx)|| defined(STM32F469xx) || defined(STM32F479xx)
  HASH_RNG_IRQn               = 80,     /*!< Hash and Rng global interrupt                                     */
#endif /* STM32F405xx || STM32F407xx || STM32F415xx || STM32F417xx || STM32F427xx || STM32F429xx || STM32F437xx || STM32F439xx || STM32F469xx || STM32F479xx */
#if defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F410Tx) || defined(STM32F410Rx) || defined(STM32F410Cx) || defined(STM32F412Cx) || defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx)
  RNG_IRQn                    = 80,     /*!< RNG global Interrupt                                              */
#endif /* STM32F405xx || STM32F407xx || STM32F410Tx || STM32F410Rx || STM32F410Cx || STM32F412Cx ||STM32F412Rx || STM32F412Vx || STM32F412Zx */
#if defined(STM32F405xx) || defined(STM32F407xx) || defined(STM32F415xx) || defined(STM32F417xx)
  FPU_IRQn                    = 81      /*!< FPU global interrupt                                               */
#elif !defined(STM32F405xx)
  FPU_IRQn                    = 81,     /*!< FPU global interrupt                                              */
#endif /* STM32F405xx || STM32F407xx || STM32F415xx || STM32F417xxs*/
#if defined(STM32F413xx) || defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
  UART7_IRQn                  = 82,     /*!< UART7 global interrupt                                            */
  UART8_IRQn                  = 83,     /*!< UART8 global interrupt                                            */
#endif /* STM32F413xx || STM32F423xx || STM32F427xx || STM32F429xx || STM32F437xx || STM32F439xx || STM32F469xx || STM32F479xx */
#if defined(STM32F401xC) || defined(STM32F401xE)  
  SPI4_IRQn                   = 84      /*!< SPI4 global Interrupt                                              */
#elif defined(STM32F411xE) ||defined(STM32F412Cx) || defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx) || defined(STM32F413xx) || defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F446xx) || defined(STM32F469xx) || defined(STM32F479xx)
  SPI4_IRQn                   = 84,     /*!< SPI4 global Interrupt                                             */
#endif /* STM32F401xC || STM32F401xE */ 
#if defined(STM32F411xE) 
  SPI5_IRQn                   = 85      /*!< SPI5 global Interrupt                                              */
#elif defined(STM32F410Cx)  || defined(STM32F410Rx)  || defined(STM32F412Cx) || defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx) || defined(STM32F413xx) || defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
  SPI5_IRQn                   = 85,     /*!< SPI5 global Interrupt                                             */
#endif /* STM32F411xE || STM32F415xx || STM32F417xx */  
#if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
  SPI6_IRQn                   = 86,     /*!< SPI6 global Interrupt                                             */
#endif /* STM32F427xx || STM32F429xx || STM32F437xx || STM32F439xx || STM32F469xx || STM32F479xx */
#if defined(STM32F413xx) || defined(STM32F423xx) || defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
  SAI1_IRQn                   = 87,     /*!< SAI1 global Interrupt                                             */
#endif /* STM32F413xx || STM32F423xx || STM32F427xx || STM32F429xx || STM32F437xx || STM32F439xx || STM32F469xx || STM32F479xx */
#if defined(STM32F413xx) || defined(STM32F423xx)
  UART9_IRQn                  = 88,     /*!< UART9 global Interrupt                                            */
  UART10_IRQn                 = 89,     /*!< UART10 global Interrupt                                           */
  QUADSPI_IRQn                = 92,     /*!< QuadSPI global Interrupt                                          */
  FMPI2C1_EV_IRQn             = 95,     /*!< FMPI2C1 Event Interrupt                                           */
  FMPI2C1_ER_IRQn             = 96,     /*!< FMPI2C1 Error Interrupt                                           */
  LPTIM1_IRQn                 = 97,     /*!< LP TIM1 interrupt                                                 */
  DFSDM2_FLT0_IRQn            = 98,     /*!< DFSDM2 Filter 0 global Interrupt                                  */
  DFSDM2_FLT1_IRQn            = 99,     /*!< DFSDM2 Filter 1 global Interrupt                                  */
  DFSDM2_FLT2_IRQn            = 100,    /*!< DFSDM2 Filter 2 global Interrupt                                  */
  DFSDM2_FLT3_IRQn            = 101     /*!< DFSDM2 Filter 3 global Interrupt                                  */
#endif /* STM32F413xx || STM32F423xx */    
#if defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)   
  LTDC_IRQn                   = 88,     /*!< LTDC global Interrupt                                              */
  LTDC_ER_IRQn                = 89,     /*!< LTDC Error global Interrupt                                        */
#endif /* STM32F429xx || STM32F439xx || STM32F469xx || STM32F479xx */    
#if defined(STM32F427xx) || defined(STM32F429xx) || defined(STM32F437xx) || defined(STM32F439xx)
  DMA2D_IRQn                  = 90      /*!< DMA2D global Interrupt                                            */
#endif /* STM32F427xx || STM32F429xx || STM32F437xx || STM32F439xx */
#if defined(STM32F469xx) || defined(STM32F479xx)
  DMA2D_IRQn                  = 90,     /*!< DMA2D global Interrupt                                            */
#endif /* STM32F469xx || STM32F479xx */  
#if defined(STM32F469xx) || defined(STM32F479xx) 
  QUADSPI_IRQn                = 91,     /*!< QUADSPI global Interrupt                                          */
  DSI_IRQn                    = 92      /*!< DSI global Interrupt                                              */
#endif/* STM32F469xx || STM32F479xx */
#if defined(STM32F410Tx) || defined( STM32F410Cx) || defined(STM32F410Rx)
  FMPI2C1_EV_IRQn             = 95,     /*!< FMPI2C1 Event Interrupt                                           */
  FMPI2C1_ER_IRQn             = 96,     /*!< FMPI2C1 Error Interrupt                                           */
  LPTIM1_IRQn                 = 97      /*!< LPTIM1 interrupt                                                  */
#endif /* STM32F410Tx || STM32F410Cx || STM32F410Rx */
#if   defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx)
  QUADSPI_IRQn                = 92,     /*!< QuadSPI global Interrupt                                          */ 
#endif /* STM32F412Rx || STM32F412Vx || STM32F412Zx  */
#if defined(STM32F412Cx) || defined(STM32F412Rx) || defined(STM32F412Vx) || defined(STM32F412Zx)
  FMPI2C1_EV_IRQn             = 95,     /*!< FMPI2C1 Event Interrupt                                           */
  FMPI2C1_ER_IRQn             = 96      /*!< FMPI2C1 Error Interrupt                                           */
#endif /* STM32F412Cx || STM32F412Rx || STM32F412Vx */ 
#if defined(STM32F446xx)
  SAI1_IRQn                   = 87,     /*!< SAI1 global Interrupt                                             */
  SAI2_IRQn                   = 91,     /*!< SAI2 global Interrupt                                             */
  QUADSPI_IRQn                = 92,     /*!< QuadSPI global Interrupt                                          */
  CEC_IRQn                    = 93,     /*!< CEC global Interrupt                                              */
  SPDIF_RX_IRQn               = 94,     /*!< SPDIF-RX global Interrupt                                          */
  FMPI2C1_EV_IRQn             = 95,     /*!< FMPI2C1 Event Interrupt                                           */
  FMPI2C1_ER_IRQn             = 96      /*!< FMPI2C1 Error Interrupt                                           */  
#endif /* STM32F446xx */
} IRQn_Type;
#if defined(STM32F405xx) || defined(STM32F407xx)
/* Legacy define */
#define  HASH_RNG_IRQn      RNG_IRQn
#endif /* STM32F405xx || STM32F407xx */

/**
  * @}
  */

